----------------------------------------
      name:  <unnamed>
       log:  C:/Users/Portatil/Desktop/E
> conomia_y_Religion/Output/RT_regressio
> n/sample_n0_rt.log
  log type:  text
 opened on:   5 Apr 2025, 03:41:06

. 
. import excel "C:/Users/Portatil/Deskto
> p/Economia_y_Religion/Version_2/STATA_
> Relig_Tolerance_Climate (Regiones).xls
> x", sheet("Sheet 1") firstrow clear
(93 vars, 97 obs)

. 
. 
. ************ Estadísticas descriptivas
>  ************
. ssc install asdoc
checking asdoc consistency and verifying
>  not already installed...
installing into C:\Users\Portatil\ado\plus\...
installation complete.

. 
. *Estadísticas descriptivas de todas las variables
. 
. asdoc su  ccps Relig_Tol_uptow7  rel_and_science_uptow7 dogood_both_uptow7 Thisworld_bot
> h_uptow7 many_relig_uptow7 log_GDP globaliz coalp_cap dmcry inst cc_percp if _mi_m==0 & 
> sam_uptow7==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ccps |         57    .3523158    .1536715       .081       .824
Relig_To~ow7 |         57    .5899078    .2031291   .0774646   .9175909
rel_and_sc~7 |         57      .49756    .2910759   .0151659   .9500595
dogood_bot~7 |         57    .6727692    .1723785   .1587302   .9364665
Thisworld_~7 |         57    .6684984    .1883777   .0836149   .9066667
-------------+---------------------------------------------------------
many_relig~7 |         57    .5208036    .2750347   .0208333   .9387211
     log_GDP |         57    9.488838    .9542647    7.12568   11.73333
    globaliz |         57    67.74929    11.72366   41.82045   89.74843
   coalp_cap |         57     .001131     .002946          0   .0200617
       dmcry |         57    4.224561    6.094619        -10         10
-------------+---------------------------------------------------------
        inst |         57   -.1602926     .934097  -1.818436   1.691806
    cc_percp |         57    .4989474    .1742605        .18         .8
Click to Open File:  Myfile.doc

. 
. 
. ********* Regresiones_no robustas**********
. 
. ** up to w7
. 
. reg ccps Relig_Tol_uptow7 i.WB_EUCA i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_E
> AP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(7, 49)        =      3.73
       Model |  .459377299         7  .065625328   Prob > F        =    0.0026
    Residual |  .863059016        49  .017613449   R-squared       =    0.3474
-------------+----------------------------------   Adj R-squared   =    0.2541
       Total |  1.32243632        56  .023614934   Root MSE        =    .13272

----------------------------------------------------------------------------------
            ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
Relig_Tol_uptow7 |   .4430742   .1335572     3.32   0.002      .174681    .7114675
       1.WB_EUCA |   .0011666    .099918     0.01   0.991     -.199626    .2019593
       2.WB_LAAC |  -.0761891   .1028993    -0.74   0.463     -.282973    .1305948
      3.WB_MEANA |  -.0272823   .1193678    -0.23   0.820     -.267161    .2125963
      5.WB_SAsia |   .1231436   .1376315     0.89   0.375    -.1534372    .3997245
   6.WB_SSAfrica |  -.0390645   .1170641    -0.33   0.740    -.2743137    .1961847
        7.WB_EAP |   .0194513   .1040607     0.19   0.852    -.1896666    .2285692
           _cons |   .1019884   .1392981     0.73   0.468    -.1779417    .3819184
----------------------------------------------------------------------------------

. 
. reg ccps Relig_Tol_uptow7  log_GDP globaliz coalp_cap dmcry inst cc_percp i.WB_EUCA i.WB
> _LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_EAP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(13, 43)       =      6.71
       Model |  .885751513        13  .068134732   Prob > F        =    0.0000
    Residual |  .436684803        43  .010155461   R-squared       =    0.6698
-------------+----------------------------------   Adj R-squared   =    0.5700
       Total |  1.32243632        56  .023614934   Root MSE        =    .10077

----------------------------------------------------------------------------------
            ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
Relig_Tol_uptow7 |   .3347715   .1098456     3.05   0.004     .1132467    .5562962
         log_GDP |  -.0058761   .0273657    -0.21   0.831    -.0610643    .0493121
        globaliz |   .0069984   .0028818     2.43   0.019     .0011867    .0128101
       coalp_cap |   2.036914   5.074506     0.40   0.690    -8.196802    12.27063
           dmcry |   .0074543   .0032915     2.26   0.029     .0008163    .0140924
            inst |  -.0202122   .0285593    -0.71   0.483    -.0778076    .0373831
        cc_percp |   .0842354   .1104487     0.76   0.450    -.1385057    .3069765
       1.WB_EUCA |   .0824545   .0804428     1.03   0.311     -.079774    .2446829
       2.WB_LAAC |    .025141   .0832611     0.30   0.764     -.142771     .193053
      3.WB_MEANA |   .1257912   .0960526     1.31   0.197    -.0679173    .3194996
      5.WB_SAsia |   .2516742   .1155057     2.18   0.035     .0187348    .4846136
   6.WB_SSAfrica |   .1528018   .1048463     1.46   0.152    -.0586409    .3642445
        7.WB_EAP |   .1062755   .0824084     1.29   0.204    -.0599168    .2724679
           _cons |  -.4386904   .2942774    -1.49   0.143    -1.032157    .1547766
----------------------------------------------------------------------------------

. 
. ** up to w7 rel_and_science_uptow7 
. 
. reg ccps rel_and_science_uptow7 i.WB_EUCA i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica 
> i.WB_EAP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(7, 49)        =      3.27
       Model |  .420793637         7  .060113377   Prob > F        =    0.0063
    Residual |  .901642679        49  .018400871   R-squared       =    0.3182
-------------+----------------------------------   Adj R-squared   =    0.2208
       Total |  1.32243632        56  .023614934   Root MSE        =    .13565

----------------------------------------------------------------------------------------
                  ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
rel_and_science_uptow7 |   .2913222   .1002896     2.90   0.005     .0897826    .4928617
             1.WB_EUCA |   -.020859   .1014642    -0.21   0.838     -.224759     .183041
             2.WB_LAAC |  -.0429309   .1063744    -0.40   0.688    -.2566981    .1708364
            3.WB_MEANA |  -.0375777   .1236067    -0.30   0.762    -.2859748    .2108193
            5.WB_SAsia |    .080409   .1375442     0.58   0.561    -.1959964    .3568143
         6.WB_SSAfrica |  -.0216021   .1243795    -0.17   0.863     -.271552    .2283478
              7.WB_EAP |  -.0044482   .1055686    -0.04   0.967    -.2165962    .2076998
                 _cons |   .2255806   .1217722     1.85   0.070    -.0191298     .470291
----------------------------------------------------------------------------------------

. 
. reg ccps rel_and_science_uptow7  log_GDP globaliz coalp_cap dmcry inst cc_percp i.WB_EUC
> A i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_EAP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(13, 43)       =      6.67
       Model |  .884013819        13  .068001063   Prob > F        =    0.0000
    Residual |  .438422497        43  .010195872   R-squared       =    0.6685
-------------+----------------------------------   Adj R-squared   =    0.5682
       Total |  1.32243632        56  .023614934   Root MSE        =    .10097

----------------------------------------------------------------------------------------
                  ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
rel_and_science_uptow7 |   .2578926   .0855802     3.01   0.004     .0853037    .4304815
               log_GDP |  -.0106232   .0275355    -0.39   0.702    -.0661539    .0449075
              globaliz |   .0073191   .0028884     2.53   0.015     .0014941    .0131441
             coalp_cap |   2.678628   5.056295     0.53   0.599    -7.518363    12.87562
                 dmcry |   .0085451   .0033347     2.56   0.014     .0018201    .0152701
                  inst |   -.028056   .0292266    -0.96   0.342     -.086997    .0308851
              cc_percp |   .0675791   .1105631     0.61   0.544    -.1553927    .2905508
             1.WB_EUCA |   .0614951   .0804839     0.76   0.449    -.1008162    .2238064
             2.WB_LAAC |   .0482936   .0830998     0.58   0.564    -.1192931    .2158803
            3.WB_MEANA |    .137305   .0978908     1.40   0.168    -.0601107    .3347207
            5.WB_SAsia |   .2175014   .1126684     1.93   0.060    -.0097161    .4447189
         6.WB_SSAfrica |   .1716591   .1067362     1.61   0.115    -.0435949    .3869131
              7.WB_EAP |   .0871587   .0821933     1.06   0.295    -.0785998    .2529172
                 _cons |  -.3403788   .2894097    -1.18   0.246     -.924029    .2432714
----------------------------------------------------------------------------------------

. 
. ** up to w7 dogood_both_uptow7
. 
. reg ccps dogood_both_uptow7 i.WB_EUCA i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB
> _EAP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(7, 49)        =      2.12
       Model |  .307142533         7  .043877505   Prob > F        =    0.0590
    Residual |  1.01529378        49  .020720281   R-squared       =    0.2323
-------------+----------------------------------   Adj R-squared   =    0.1226
       Total |  1.32243632        56  .023614934   Root MSE        =    .14395

------------------------------------------------------------------------------------
              ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
dogood_both_uptow7 |   .2132412   .1504701     1.42   0.163    -.0891397    .5156221
         1.WB_EUCA |  -.0368617   .1074658    -0.34   0.733    -.2528223    .1790989
         2.WB_LAAC |  -.1084492   .1121697    -0.97   0.338    -.3338627    .1169642
        3.WB_MEANA |  -.1696719   .1184256    -1.43   0.158    -.4076571    .0683132
        5.WB_SAsia |  -.0209635   .1410203    -0.15   0.882    -.3043544    .2624273
     6.WB_SSAfrica |  -.1431999   .1213492    -1.18   0.244    -.3870603    .1006605
          7.WB_EAP |  -.0107879   .1127065    -0.10   0.924    -.2372801    .2157044
             _cons |   .2814036   .1531113     1.84   0.072     -.026285    .5890922
------------------------------------------------------------------------------------

. 
. reg ccps dogood_both_uptow7  log_GDP globaliz coalp_cap dmcry inst cc_percp i.WB_EUCA i.
> WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_EAP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(13, 43)       =      5.74
       Model |   .83914549        13  .064549653   Prob > F        =    0.0000
    Residual |  .483290825        43  .011239322   R-squared       =    0.6345
-------------+----------------------------------   Adj R-squared   =    0.5241
       Total |  1.32243632        56  .023614934   Root MSE        =    .10602

------------------------------------------------------------------------------------
              ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
dogood_both_uptow7 |   .2355224   .1143017     2.06   0.045     .0050112    .4660337
           log_GDP |  -.0013083   .0287645    -0.05   0.964    -.0593175    .0567009
          globaliz |   .0071446   .0030316     2.36   0.023     .0010307    .0132584
         coalp_cap |   3.034819   5.317797     0.57   0.571     -7.68954    13.75918
             dmcry |   .0065108   .0034669     1.88   0.067    -.0004808    .0135024
              inst |   -.003561   .0295197    -0.12   0.905    -.0630931    .0559711
          cc_percp |   .1167816   .1183325     0.99   0.329    -.1218587    .3554218
         1.WB_EUCA |    .084197   .0848511     0.99   0.327    -.0869214    .2553155
         2.WB_LAAC |   .0280796   .0877604     0.32   0.751    -.1489062    .2050654
        3.WB_MEANA |   .0727353   .0976377     0.74   0.460    -.1241699    .2696404
        5.WB_SAsia |   .2369513   .1246243     1.90   0.064    -.0143775    .4882801
     6.WB_SSAfrica |   .1428856   .1116985     1.28   0.208    -.0823759    .3681472
          7.WB_EAP |   .1126959   .0875853     1.29   0.205    -.0639366    .2893285
             _cons |  -.4565441   .3197749    -1.43   0.161    -1.101432    .1883435
------------------------------------------------------------------------------------

. 
. 
. ** up to w7  Thisworld_both_uptow7
. 
. reg ccps  Thisworld_both_uptow7 i.WB_EUCA i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica 
> i.WB_EAP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(7, 49)        =      2.23
       Model |  .319626425         7  .045660918   Prob > F        =    0.0474
    Residual |  1.00280989        49  .020465508   R-squared       =    0.2417
-------------+----------------------------------   Adj R-squared   =    0.1334
       Total |  1.32243632        56  .023614934   Root MSE        =    .14306

---------------------------------------------------------------------------------------
                 ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
Thisworld_both_uptow7 |   .2346308   .1443135     1.63   0.110    -.0553779    .5246396
            1.WB_EUCA |  -.0449583   .1066296    -0.42   0.675    -.2592384    .1693218
            2.WB_LAAC |  -.1054857   .1111647    -0.95   0.347    -.3288795    .1179082
           3.WB_MEANA |  -.1645919   .1174547    -1.40   0.167    -.4006258    .0714421
           5.WB_SAsia |  -.0045977   .1415789    -0.03   0.974    -.2891111    .2799157
        6.WB_SSAfrica |  -.1193915   .1237825    -0.96   0.340    -.3681417    .1293587
             7.WB_EAP |  -.0230055   .1110219    -0.21   0.837    -.2461124    .2001014
                _cons |   .2681153    .147883     1.81   0.076    -.0290668    .5652973
---------------------------------------------------------------------------------------

. 
. reg ccps  Thisworld_both_uptow7  log_GDP globaliz coalp_cap dmcry inst cc_percp i.WB_EUC
> A i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_EAP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(13, 43)       =      5.54
       Model |  .828001589        13   .06369243   Prob > F        =    0.0000
    Residual |  .494434727        43  .011498482   R-squared       =    0.6261
-------------+----------------------------------   Adj R-squared   =    0.5131
       Total |  1.32243632        56  .023614934   Root MSE        =    .10723

---------------------------------------------------------------------------------------
                 ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
Thisworld_both_uptow7 |   .1978541   .1109346     1.78   0.082    -.0258669    .4215751
              log_GDP |   .0032552   .0292518     0.11   0.912    -.0557366    .0622471
             globaliz |   .0071323   .0030664     2.33   0.025     .0009484    .0133162
            coalp_cap |   2.897524   5.404911     0.54   0.595    -8.002518    13.79757
                dmcry |   .0068638   .0034994     1.96   0.056    -.0001934     .013921
                 inst |  -.0102858   .0300646    -0.34   0.734    -.0709168    .0503452
             cc_percp |   .0840625   .1176975     0.71   0.479    -.1532971     .321422
            1.WB_EUCA |   .0671168   .0854431     0.79   0.436    -.1051956    .2394292
            2.WB_LAAC |   .0299204   .0888027     0.34   0.738    -.1491672    .2090081
           3.WB_MEANA |   .0524099   .0969052     0.54   0.591    -.1430181    .2478379
           5.WB_SAsia |   .2137289   .1238261     1.73   0.092    -.0359903    .4634481
        6.WB_SSAfrica |   .1416015   .1140687     1.24   0.221    -.0884399     .371643
             7.WB_EAP |   .0914553   .0874389     1.05   0.301     -.084882    .2677926
                _cons |  -.4459109   .3266164    -1.37   0.179    -1.104596    .2127738
---------------------------------------------------------------------------------------

. 
. ** up to w7  many_relig_uptow7
. 
. reg ccps  many_relig_uptow7 i.WB_EUCA i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB
> _EAP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(7, 49)        =      4.81
       Model |  .538588646         7  .076941235   Prob > F        =    0.0004
    Residual |  .783847669        49  .015996891   R-squared       =    0.4073
-------------+----------------------------------   Adj R-squared   =    0.3226
       Total |  1.32243632        56  .023614934   Root MSE        =    .12648

-----------------------------------------------------------------------------------
             ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
many_relig_uptow7 |   .3450551   .0835174     4.13   0.000     .1772205    .5128896
        1.WB_EUCA |   .0557907   .0974109     0.57   0.569    -.1399638    .2515452
        2.WB_LAAC |  -.0524752   .0984151    -0.53   0.596    -.2502478    .1452974
       3.WB_MEANA |   .0097053   .1139552     0.09   0.932    -.2192963    .2387069
       5.WB_SAsia |    .127264   .1272239     1.00   0.322    -.1284021      .38293
    6.WB_SSAfrica |  -.0902148   .1058399    -0.85   0.398    -.3029081    .1224785
         7.WB_EAP |   .0435583   .0997569     0.44   0.664    -.1569107    .2440274
            _cons |   .1579922   .1130216     1.40   0.168    -.0691333    .3851176
-----------------------------------------------------------------------------------

. 
. reg ccps  many_relig_uptow7  log_GDP globaliz coalp_cap dmcry inst cc_percp i.WB_EUCA i.
> WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_EAP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(13, 43)       =      6.54
       Model |  .878291461        13  .067560882   Prob > F        =    0.0000
    Residual |  .444144855        43   .01032895   R-squared       =    0.6641
-------------+----------------------------------   Adj R-squared   =    0.5626
       Total |  1.32243632        56  .023614934   Root MSE        =    .10163

-----------------------------------------------------------------------------------
             ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
many_relig_uptow7 |   .2282619   .0787113     2.90   0.006     .0695255    .3869983
          log_GDP |  -.0119399   .0277752    -0.43   0.669     -.067954    .0440741
         globaliz |    .006534   .0029124     2.24   0.030     .0006606    .0124075
        coalp_cap |   2.629029   5.093618     0.52   0.608    -7.643231    12.90129
            dmcry |   .0074912   .0033205     2.26   0.029     .0007949    .0141876
             inst |  -.0200988   .0288375    -0.70   0.490    -.0782552    .0380577
         cc_percp |   .0486934   .1115104     0.44   0.665    -.1761887    .2735756
        1.WB_EUCA |   .0981598   .0816575     1.20   0.236    -.0665182    .2628378
        2.WB_LAAC |    .025035   .0840009     0.30   0.767    -.1443689     .194439
       3.WB_MEANA |    .110074   .0954712     1.15   0.255    -.0824621      .30261
       5.WB_SAsia |   .1944426   .1119541     1.74   0.090    -.0313344    .4202195
    6.WB_SSAfrica |   .0643061   .1030167     0.62   0.536    -.1434468     .272059
         7.WB_EAP |   .1024653   .0830196     1.23   0.224    -.0649596    .2698902
            _cons |  -.2439006   .2893094    -0.84   0.404    -.8273486    .3395474
-----------------------------------------------------------------------------------

. 
. 
. ** up to w6
. 
. reg ccps Relig_Tol_uptow6 i.WB_EUCA i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_E
> AP if sam_uptow6==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        49
-------------+----------------------------------   F(7, 41)        =      3.71
       Model |   .45653499         7  .065219284   Prob > F        =    0.0034
    Residual |  .720310684        41  .017568553   R-squared       =    0.3879
-------------+----------------------------------   Adj R-squared   =    0.2834
       Total |  1.17684567        48  .024517618   Root MSE        =    .13255

----------------------------------------------------------------------------------
            ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
Relig_Tol_uptow6 |   .5047732   .1451206     3.48   0.001     .2116962    .7978503
       1.WB_EUCA |   .0184003   .1367291     0.13   0.894    -.2577298    .2945304
       2.WB_LAAC |  -.0291498    .140587    -0.21   0.837    -.3130711    .2547714
      3.WB_MEANA |   .0370743    .153425     0.24   0.810    -.2727738    .3469224
      5.WB_SAsia |   .1196914   .1702705     0.70   0.486    -.2241768    .4635596
   6.WB_SSAfrica |  -.0092636   .1499977    -0.06   0.951    -.3121902    .2936629
        7.WB_EAP |   .0646222   .1409939     0.46   0.649    -.2201208    .3493653
           _cons |   .0337042   .1694672     0.20   0.843    -.3085418    .3759502
----------------------------------------------------------------------------------

. 
. reg ccps Relig_Tol_uptow6  log_GDP globaliz coalp_cap dmcry inst cc_percp i.WB_EUCA i.WB
> _LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_EAP if sam_uptow6==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        49
-------------+----------------------------------   F(13, 35)       =      6.23
       Model |  .821906225        13  .063223556   Prob > F        =    0.0000
    Residual |  .354939449        35  .010141127   R-squared       =    0.6984
-------------+----------------------------------   Adj R-squared   =    0.5864
       Total |  1.17684567        48  .024517618   Root MSE        =     .1007

----------------------------------------------------------------------------------
            ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
Relig_Tol_uptow6 |   .4060156   .1188083     3.42   0.002     .1648219    .6472092
         log_GDP |   .0178679    .030059     0.59   0.556    -.0431551    .0788908
        globaliz |   .0072383   .0028978     2.50   0.017     .0013554    .0131211
       coalp_cap |   .2235324   5.190683     0.04   0.966    -10.31411    10.76118
           dmcry |   .0077115   .0037521     2.06   0.047     .0000944    .0153286
            inst |  -.0341165   .0295055    -1.16   0.255    -.0940159    .0257829
        cc_percp |   .0371932   .1485371     0.25   0.804    -.2643532    .3387395
       1.WB_EUCA |   .1101772   .1073464     1.03   0.312    -.1077475     .328102
       2.WB_LAAC |   .0677564   .1120198     0.60   0.549    -.1596559    .2951686
      3.WB_MEANA |   .1721867   .1203451     1.43   0.161    -.0721269    .4165002
      5.WB_SAsia |   .2440793   .1409176     1.73   0.092    -.0419987    .5301572
   6.WB_SSAfrica |    .198675     .13202     1.50   0.141    -.0693398    .4666899
        7.WB_EAP |   .1372296   .1095558     1.25   0.219    -.0851806    .3596397
           _cons |  -.7423386   .3353233    -2.21   0.033    -1.423081    -.061596
----------------------------------------------------------------------------------

. 
. 
. ** only w6
. 
. reg ccps Relig_Tol_onlyw6 i.WB_EUCA i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_E
> AP if sam_onlyw6==1 & _mi_m==0
note: 7.WB_EAP omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        44
-------------+----------------------------------   F(6, 37)        =      3.44
       Model |  .403371056         6  .067228509   Prob > F        =    0.0084
    Residual |  .723061375        37  .019542199   R-squared       =    0.3581
-------------+----------------------------------   Adj R-squared   =    0.2540
       Total |  1.12643243        43  .026196103   Root MSE        =    .13979

----------------------------------------------------------------------------------
            ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
Relig_Tol_onlyw6 |   .4832762   .1589947     3.04   0.004     .1611223    .8054301
       1.WB_EUCA |  -.0326178   .0600239    -0.54   0.590    -.1542378    .0890022
       2.WB_LAAC |  -.0708562   .0700791    -1.01   0.319    -.2128498    .0711374
      3.WB_MEANA |  -.0646793   .0840428    -0.77   0.446    -.2349662    .1056076
      5.WB_SAsia |   .0262939   .1578604     0.17   0.869    -.2935617    .3461494
   6.WB_SSAfrica |  -.1663023   .0956004    -1.74   0.090    -.3600071    .0274025
        7.WB_EAP |          0  (omitted)
           _cons |   .1320388   .1093051     1.21   0.235    -.0894343    .3535119
----------------------------------------------------------------------------------

. 
. reg ccps Relig_Tol_onlyw6  log_GDP globaliz coalp_cap dmcry inst cc_percp i.WB_EUCA i.WB
> _LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_EAP if sam_onlyw6==1 & _mi_m==0
note: 7.WB_EAP omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        44
-------------+----------------------------------   F(12, 31)       =      5.22
       Model |  .753297991        12  .062774833   Prob > F        =    0.0001
    Residual |  .373134441        31  .012036595   R-squared       =    0.6687
-------------+----------------------------------   Adj R-squared   =    0.5405
       Total |  1.12643243        43  .026196103   Root MSE        =    .10971

----------------------------------------------------------------------------------
            ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
Relig_Tol_onlyw6 |   .3580724   .1328407     2.70   0.011     .0871421    .6290027
         log_GDP |   .0073512   .0389079     0.19   0.851     -.072002    .0867045
        globaliz |   .0083671   .0043315     1.93   0.063    -.0004671    .0172014
       coalp_cap |   3.596078   5.679606     0.63   0.531    -7.987554    15.17971
           dmcry |   .0061126   .0052893     1.16   0.257    -.0046751    .0169003
            inst |  -.0313841   .0331922    -0.95   0.352    -.0990801     .036312
        cc_percp |   .0890443   .1840506     0.48   0.632    -.2863294     .464418
       1.WB_EUCA |  -.0061925   .0500294    -0.12   0.902    -.1082282    .0958431
       2.WB_LAAC |  -.0347261   .0669739    -0.52   0.608    -.1713202     .101868
      3.WB_MEANA |  -.0012365   .0713877    -0.02   0.986    -.1468326    .1443597
      5.WB_SAsia |   .1266808   .1456725     0.87   0.391    -.1704202    .4237817
   6.WB_SSAfrica |   .0406549   .1148734     0.35   0.726    -.1936309    .2749407
        7.WB_EAP |          0  (omitted)
           _cons |  -.5722749   .3513021    -1.63   0.113     -1.28876    .1442105
----------------------------------------------------------------------------------

. 
. 
. ** only w7
. 
. reg ccps Relig_Tol_onlyw7 i.WB_EUCA i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_E
> AP if sam_onlyw7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        41
-------------+----------------------------------   F(7, 33)        =      2.44
       Model |  .223141626         7  .031877375   Prob > F        =    0.0393
    Residual |  .431008325        33  .013060858   R-squared       =    0.3411
-------------+----------------------------------   Adj R-squared   =    0.2014
       Total |  .654149951        40  .016353749   Root MSE        =    .11428

----------------------------------------------------------------------------------
            ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
Relig_Tol_onlyw7 |   .3849847   .1471992     2.62   0.013     .0855056    .6844638
       1.WB_EUCA |  -.0274459   .1219775    -0.23   0.823    -.2756109    .2207191
       2.WB_LAAC |  -.1143149   .1200888    -0.95   0.348    -.3586374    .1300075
      3.WB_MEANA |  -.0875602   .1364035    -0.64   0.525    -.3650752    .1899548
      5.WB_SAsia |   .0969903   .1705776     0.57   0.573    -.2500524     .444033
   6.WB_SSAfrica |  -.0613796   .1440339    -0.43   0.673    -.3544188    .2316596
        7.WB_EAP |  -.0272707   .1213371    -0.22   0.824    -.2741328    .2195915
           _cons |   .1802318     .16349     1.10   0.278    -.1523911    .5128547
----------------------------------------------------------------------------------

. 
. reg ccps Relig_Tol_onlyw7  log_GDP globaliz coalp_cap dmcry inst cc_percp i.WB_EUCA i.WB
> _LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_EAP if sam_onlyw7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        41
-------------+----------------------------------   F(13, 27)       =      3.07
       Model |   .39033011        13  .030025393   Prob > F        =    0.0067
    Residual |  .263819841        27  .009771105   R-squared       =    0.5967
-------------+----------------------------------   Adj R-squared   =    0.4025
       Total |  .654149951        40  .016353749   Root MSE        =    .09885

----------------------------------------------------------------------------------
            ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
Relig_Tol_onlyw7 |   .2945106   .1482502     1.99   0.057    -.0096737     .598695
         log_GDP |  -.0141818   .0328909    -0.43   0.670    -.0816684    .0533048
        globaliz |   .0055097   .0032324     1.70   0.100    -.0011226    .0121421
       coalp_cap |   3.804906   5.261335     0.72   0.476    -6.990461    14.60027
           dmcry |   .0066011   .0040405     1.63   0.114    -.0016894    .0148915
            inst |   .0104993   .0369347     0.28   0.778    -.0652843     .086283
        cc_percp |  -.0818801   .1321769    -0.62   0.541    -.3530847    .1893246
       1.WB_EUCA |   .0207973   .1108427     0.19   0.853    -.2066332    .2482277
       2.WB_LAAC |  -.0017196   .1107649    -0.02   0.988    -.2289905    .2255513
      3.WB_MEANA |   .0598646   .1280366     0.47   0.644    -.2028449    .3225741
      5.WB_SAsia |   .2003626    .157311     1.27   0.214     -.122413    .5231382
   6.WB_SSAfrica |   .1119406   .1389275     0.81   0.427    -.1731151    .3969963
        7.WB_EAP |   .0472302   .1094557     0.43   0.670    -.1773543    .2718148
           _cons |  -.0849408   .3686025    -0.23   0.819    -.8412506     .671369
----------------------------------------------------------------------------------

. 
. 
. ** índince ponderado
. 
. reg ccps Relig_Tol_Pond i.WB_EUCA i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_EAP
>  if sam_onlyw7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        41
-------------+----------------------------------   F(7, 33)        =      2.44
       Model |   .22330337         7  .031900481   Prob > F        =    0.0391
    Residual |  .430846581        33  .013055957   R-squared       =    0.3414
-------------+----------------------------------   Adj R-squared   =    0.2017
       Total |  .654149951        40  .016353749   Root MSE        =    .11426

--------------------------------------------------------------------------------
          ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
Relig_Tol_Pond |    .353956   .1351877     2.62   0.013     .0789146    .6289973
     1.WB_EUCA |  -.0249066   .1221342    -0.20   0.840    -.2733904    .2235773
     2.WB_LAAC |  -.1038369   .1203776    -0.86   0.395     -.348747    .1410733
    3.WB_MEANA |  -.0728503   .1386833    -0.53   0.603    -.3550036    .2093029
    5.WB_SAsia |    .087694   .1684923     0.52   0.606    -.2551061    .4304942
 6.WB_SSAfrica |  -.0647975   .1434682    -0.45   0.654    -.3566859    .2270908
      7.WB_EAP |  -.0203879   .1217476    -0.17   0.868    -.2680853    .2273094
         _cons |   .2015595   .1576643     1.28   0.210     -.119211    .5223299
--------------------------------------------------------------------------------

. 
. reg ccps Relig_Tol_Pond log_GDP globaliz coalp_cap dmcry inst cc_percp i.WB_EUCA i.WB_LA
> AC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_EAP if sam_onlyw7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        41
-------------+----------------------------------   F(13, 27)       =      3.16
       Model |  .394539663        13  .030349205   Prob > F        =    0.0056
    Residual |  .259610289        27  .009615196   R-squared       =    0.6031
-------------+----------------------------------   Adj R-squared   =    0.4120
       Total |  .654149951        40  .016353749   Root MSE        =    .09806

--------------------------------------------------------------------------------
          ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
Relig_Tol_Pond |   .2862087   .1357021     2.11   0.044      .007771    .5646464
       log_GDP |  -.0148689   .0325967    -0.46   0.652    -.0817517    .0520139
      globaliz |   .0053191   .0031959     1.66   0.108    -.0012384    .0118766
     coalp_cap |    3.10078   5.274164     0.59   0.561     -7.72091    13.92247
         dmcry |   .0071119   .0040369     1.76   0.089     -.001171    .0153949
          inst |   .0132132   .0362903     0.36   0.719    -.0612484    .0876748
      cc_percp |  -.0964763    .130804    -0.74   0.467     -.364864    .1719114
     1.WB_EUCA |   .0261975    .110146     0.24   0.814    -.1998035    .2521985
     2.WB_LAAC |   .0071618   .1095497     0.07   0.948    -.2176157    .2319393
    3.WB_MEANA |   .0788855   .1292662     0.61   0.547    -.1863468    .3441179
    5.WB_SAsia |   .1990095   .1543953     1.29   0.208    -.1177834    .5158024
 6.WB_SSAfrica |   .1136889   .1377158     0.83   0.416    -.1688805    .3962584
      7.WB_EAP |   .0567061   .1090057     0.52   0.607     -.166955    .2803673
         _cons |  -.0548423   .3636823    -0.15   0.881    -.8010567    .6913721
--------------------------------------------------------------------------------

. 
. 
. ** por regiones
. 
. **crear variable categórica
. 
. encode Regiones, gen(regiones)

. 
. reg ccps c.Relig_Tol_uptow7##regiones if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(13, 43)       =      3.86
       Model |  .712384358        13  .054798797   Prob > F        =    0.0004
    Residual |  .610051958        43  .014187255   R-squared       =    0.5387
-------------+----------------------------------   Adj R-squared   =    0.3992
       Total |  1.32243632        56  .023614934   Root MSE        =    .11911

------------------------------------------------------------------------------------
              ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
  Relig_Tol_uptow7 |   .1938593   .2241427     0.86   0.392    -.2581675    .6458862
                   |
          regiones |
             EUCA  |  -.5937672   .2012579    -2.95   0.005    -.9996424   -.1878919
             LAAC  |   .1287757   .6830505     0.19   0.851    -1.248727    1.506278
            MEANA  |  -.0776539   .2069954    -0.38   0.709       -.4951    .3397921
         NAmerica  |   -1.23641   2.772862    -0.45   0.658    -6.828419    4.355598
            SAsia  |    .034945    .186612     0.19   0.852     -.341394     .411284
         SSAfrica  |   .1585405   .2467423     0.64   0.524    -.3390628    .6561438
                   |
          regiones#|
c.Relig_Tol_uptow7 |
             EUCA  |   .8707346   .2980237     2.92   0.006     .2697125    1.471757
             LAAC  |  -.2749633   .9298541    -0.30   0.769    -2.150193    1.600266
            MEANA  |  -.1311114   .4533272    -0.29   0.774    -1.045333    .7831099
         NAmerica  |    1.61795   3.597513     0.45   0.655    -5.637127    8.873028
            SAsia  |   -.081565   .3796173    -0.21   0.831    -.8471362    .6840062
         SSAfrica  |  -.6138716   .4860829    -1.26   0.213    -1.594151     .366408
                   |
             _cons |    .283408   .1504643     1.88   0.066    -.0200323    .5868483
------------------------------------------------------------------------------------

. 
. reg ccps c.Relig_Tol_uptow7##regiones log_GDP globaliz coalp_cap dmcry inst cc_percp if 
> sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(19, 37)       =      7.12
       Model |  1.03844644        19  .054655076   Prob > F        =    0.0000
    Residual |  .283989879        37  .007675402   R-squared       =    0.7853
-------------+----------------------------------   Adj R-squared   =    0.6750
       Total |  1.32243632        56  .023614934   Root MSE        =    .08761

------------------------------------------------------------------------------------
              ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
  Relig_Tol_uptow7 |   .2512023   .1878797     1.34   0.189    -.1294781    .6318828
                   |
          regiones |
             EUCA  |   -.446545    .163445    -2.73   0.010    -.7777159    -.115374
             LAAC  |   .2192768   .5253319     0.42   0.679    -.8451467      1.2837
            MEANA  |    .100924   .1700856     0.59   0.557    -.2437021      .44555
         NAmerica  |  -1.015251   2.056259    -0.49   0.624    -5.181626    3.151125
            SAsia  |   .1515509   .1454022     1.04   0.304    -.1430618    .4461636
         SSAfrica  |   .1851129   .1897674     0.98   0.336    -.1993924    .5696182
                   |
          regiones#|
c.Relig_Tol_uptow7 |
             EUCA  |   .6443673   .2490887     2.59   0.014     .1396655    1.149069
             LAAC  |  -.4310176   .7170081    -0.60   0.551    -1.883814    1.021779
            MEANA  |  -.3244887   .3791121    -0.86   0.398    -1.092643    .4436654
         NAmerica  |   1.212262   2.668345     0.45   0.652    -4.194318    6.618843
            SAsia  |  -.2731917   .2967976    -0.92   0.363    -.8745607    .3281774
         SSAfrica  |  -.4571508   .3858938    -1.18   0.244    -1.239046    .3247442
                   |
           log_GDP |  -.0164482   .0244851    -0.67   0.506    -.0660597    .0331632
          globaliz |   .0045727   .0026276     1.74   0.090    -.0007514    .0098967
         coalp_cap |   2.806868   4.633863     0.61   0.548     -6.58223    12.19597
             dmcry |   .0089953   .0029888     3.01   0.005     .0029395    .0150512
              inst |  -.0168975   .0278933    -0.61   0.548    -.0734147    .0396197
          cc_percp |   .1298004   .1044991     1.24   0.222    -.0819349    .3415357
             _cons |  -.0332511   .2841264    -0.12   0.907     -.608946    .5424437
------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:/Users/Portatil/Desktop/Economia_y_Religion/Output/RT_regression/sample_n0_
> rt.log
  log type:  text
 closed on:   5 Apr 2025, 03:41:10
------------------------------------------------------------------------------------------
