---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/Portatil/Desktop/Economia_y_Religion/Output/RT_regression/sample_n0_normalized_rt.log
  log type:  text
 opened on:   5 Apr 2025, 04:25:13

. 
. import excel "C:/Users/Portatil/Desktop/Economia_y_Religion/Version_2/STATA_Weighted_Relig_Tolerance_Climate (Regiones).xlsx", firstr
> ow clear
(96 vars, 97 obs)

. 
. 
. ************ Estadísticas descriptivas ************
. ssc install asdoc
checking asdoc consistency and verifying not already installed...
all files already exist and are up to date.

. 
. *Estadísticas descriptivas de todas las variables
. 
. asdoc su  ccps W_RTI_normalized  rel_and_science_uptow7 dogood_both_uptow7 Thisworld_both_uptow7 many_relig_uptow7 log_GDP globaliz c
> oalp_cap dmcry inst cc_percp if _mi_m==0 & sam_uptow7==1
(File Myfile.doc already exists, option append was assumed)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ccps |         57    .3523158    .1536715       .081       .824
W_RTI_norm~d |         55    .3752885     .235109          0          1
rel_and_sc~7 |         57      .49756    .2910759   .0151659   .9500595
dogood_bot~7 |         57    .6727692    .1723785   .1587302   .9364665
Thisworld_~7 |         57    .6684984    .1883777   .0836149   .9066667
-------------+---------------------------------------------------------
many_relig~7 |         57    .5208036    .2750347   .0208333   .9387211
     log_GDP |         57    9.488838    .9542647    7.12568   11.73333
    globaliz |         57    67.74929    11.72366   41.82045   89.74843
   coalp_cap |         57     .001131     .002946          0   .0200617
       dmcry |         57    4.224561    6.094619        -10         10
-------------+---------------------------------------------------------
        inst |         57   -.1602926     .934097  -1.818436   1.691806
    cc_percp |         57    .4989474    .1742605        .18         .8
Click to Open File:  Myfile.doc

. 
. 
. ********* Regresiones_no robustas**********
. 
. ** up to w7
. 
. reg ccps W_RTI_normalized i.WB_EUCA i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_EAP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        55
-------------+----------------------------------   F(7, 47)        =      3.16
       Model |  .408297448         7  .058328207   Prob > F        =    0.0081
    Residual |  .868898661        47  .018487206   R-squared       =    0.3197
-------------+----------------------------------   Adj R-squared   =    0.2184
       Total |  1.27719611        54   .02365178   Root MSE        =    .13597

----------------------------------------------------------------------------------
            ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
W_RTI_normalized |  -.3621213   .1204161    -3.01   0.004    -.6043673   -.1198754
       1.WB_EUCA |  -.0086873   .1025208    -0.08   0.933    -.2149327     .197558
       2.WB_LAAC |  -.0866418   .1053305    -0.82   0.415    -.2985395    .1252559
      3.WB_MEANA |  -.0496648   .1209068    -0.41   0.683    -.2928979    .1935682
      5.WB_SAsia |   .1079502    .141044     0.77   0.448    -.1757938    .3916942
   6.WB_SSAfrica |   -.049696   .1199132    -0.41   0.680    -.2909302    .1915382
        7.WB_EAP |   .0012101   .1075403     0.01   0.991     -.215133    .2175532
           _cons |   .5080246   .0985088     5.16   0.000     .3098505    .7061987
----------------------------------------------------------------------------------

. 
. reg ccps W_RTI_normalized  log_GDP globaliz coalp_cap dmcry inst cc_percp i.WB_EUCA i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.W
> B_EAP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        55
-------------+----------------------------------   F(13, 41)       =      6.03
       Model |  .838556196        13  .064504323   Prob > F        =    0.0000
    Residual |  .438639913        41  .010698534   R-squared       =    0.6566
-------------+----------------------------------   Adj R-squared   =    0.5477
       Total |  1.27719611        54   .02365178   Root MSE        =    .10343

----------------------------------------------------------------------------------
            ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
W_RTI_normalized |  -.2711747   .0978559    -2.77   0.008    -.4687988   -.0735507
         log_GDP |  -.0079274   .0288244    -0.28   0.785    -.0661394    .0502846
        globaliz |   .0069305   .0029677     2.34   0.024     .0009372    .0129238
       coalp_cap |   2.387153   5.296093     0.45   0.655    -8.308523    13.08283
           dmcry |   .0072282   .0033798     2.14   0.038     .0004026    .0140538
            inst |   -.012669   .0306076    -0.41   0.681    -.0744823    .0491443
        cc_percp |   .0808218   .1174981     0.69   0.495    -.1564704     .318114
       1.WB_EUCA |     .07763   .0828767     0.94   0.354    -.0897428    .2450029
       2.WB_LAAC |   .0249403   .0855729     0.29   0.772    -.1478775    .1977582
      3.WB_MEANA |   .1154461   .0983321     1.17   0.247    -.0831396    .3140319
      5.WB_SAsia |   .2495279   .1205148     2.07   0.045     .0061434    .4929124
   6.WB_SSAfrica |   .1480077   .1098643     1.35   0.185    -.0738677    .3698831
        7.WB_EAP |   .1006741   .0864736     1.16   0.251    -.0739628    .2753111
           _cons |  -.1102734   .3069147    -0.36   0.721    -.7301003    .5095534
----------------------------------------------------------------------------------

. 
. 
. ** por regiones
. 
. **crear variable categórica
. 
. encode Regiones, gen(regiones)

. 
. reg ccps c.W_RTI_normalized##regiones if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        55
-------------+----------------------------------   F(13, 41)       =      3.20
       Model |  .643131454        13   .04947165   Prob > F        =    0.0022
    Residual |  .634064655        41  .015464992   R-squared       =    0.5035
-------------+----------------------------------   Adj R-squared   =    0.3461
       Total |  1.27719611        54   .02365178   Root MSE        =    .12436

---------------------------------------------------------------------------------------------
                       ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
           W_RTI_normalized |  -.1572032   .2125255    -0.74   0.464    -.5864072    .2720009
                            |
                   regiones |
                      EUCA  |   .2182646   .1001514     2.18   0.035     .0160048    .4205244
                      LAAC  |  -.0809075   .2018582    -0.40   0.691    -.4885684    .3267534
                     MEANA  |  -.1717158   .2435573    -0.71   0.485    -.6635897    .3201582
                  NAmerica  |   .3760985   .7899239     0.48   0.637    -1.219185    1.971382
                     SAsia  |  -.0318319   .2138077    -0.15   0.882    -.4636252    .3999615
                  SSAfrica  |  -.3481577   .2277156    -1.53   0.134    -.8080388    .1117233
                            |
regiones#c.W_RTI_normalized |
                      EUCA  |   -.770977    .283542    -2.72   0.010    -1.343602   -.1983522
                      LAAC  |   .0963194   .9774364     0.10   0.922    -1.877654    2.070292
                     MEANA  |   .0853778   .4135796     0.21   0.837     -.749863    .9206187
                  NAmerica  |  -1.961404   4.388652    -0.45   0.657    -10.82447    6.901659
                     SAsia  |    .071329   .3300191     0.22   0.830    -.5951581     .737816
                  SSAfrica  |    .447061   .4304906     1.04   0.305    -.4223324    1.316454
                            |
                      _cons |   .4449057   .0785463     5.66   0.000     .2862782    .6035331
---------------------------------------------------------------------------------------------

. 
. reg ccps c.W_RTI_normalized##regiones log_GDP globaliz coalp_cap dmcry inst cc_percp if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        55
-------------+----------------------------------   F(19, 35)       =      6.07
       Model |  .979934794        19  .051575515   Prob > F        =    0.0000
    Residual |  .297261315        35   .00849318   R-squared       =    0.7673
-------------+----------------------------------   Adj R-squared   =    0.6409
       Total |  1.27719611        54   .02365178   Root MSE        =    .09216

---------------------------------------------------------------------------------------------
                       ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
           W_RTI_normalized |  -.2193172   .1785004    -1.23   0.227    -.5816922    .1430578
                            |
                   regiones |
                      EUCA  |   .1365019   .0855338     1.60   0.120     -.037141    .3101448
                      LAAC  |  -.1358194   .1620495    -0.84   0.408    -.4647973    .1931584
                     MEANA  |   -.148376   .2060954    -0.72   0.476    -.5667719    .2700199
                  NAmerica  |   .1959564   .5923977     0.33   0.743    -1.006675    1.398588
                     SAsia  |  -.0937131   .1718112    -0.55   0.589    -.4425084    .2550822
                  SSAfrica  |  -.2179752    .195948    -1.11   0.274    -.6157707    .1798203
                            |
regiones#c.W_RTI_normalized |
                      EUCA  |  -.5365911   .2367495    -2.27   0.030    -1.017218   -.0559641
                      LAAC  |   .2490081   .7556765     0.33   0.744    -1.285097    1.783113
                     MEANA  |   .2188263   .3479219     0.63   0.533    -.4874927    .9251453
                  NAmerica  |  -1.540671   3.283053    -0.47   0.642    -8.205624    5.124282
                     SAsia  |   .2493627   .2619867     0.95   0.348    -.2824986    .7812241
                  SSAfrica  |   .3914234   .3467485     1.13   0.267    -.3125135     1.09536
                            |
                    log_GDP |  -.0131444   .0263865    -0.50   0.621    -.0667117     .040423
                   globaliz |   .0050448   .0027674     1.82   0.077    -.0005734     .010663
                  coalp_cap |   3.158346   4.964038     0.64   0.529    -6.919186    13.23588
                      dmcry |   .0087052   .0031395     2.77   0.009     .0023318    .0150787
                       inst |  -.0150201    .030354    -0.49   0.624    -.0766421    .0466019
                   cc_percp |   .1010979   .1146042     0.88   0.384    -.1315609    .3337567
                      _cons |   .1422792   .2714915     0.52   0.604    -.4088779    .6934363
---------------------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  C:/Users/Portatil/Desktop/Economia_y_Religion/Output/RT_regression/sample_n0_normalized_rt.log
  log type:  text
 closed on:   5 Apr 2025, 04:25:15
---------------------------------------------------------------------------------------------------------------------------------------
