------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/Portatil/Desktop/Economia_y_Religion/Output/RT_regression/sample_n0_
> weighted_rt.log
  log type:  text
 opened on:   5 Apr 2025, 03:56:55

. 
. import excel "C:/Users/Portatil/Desktop/Economia_y_Religion/Version_2/STATA_Weighted_Rel
> ig_Tolerance_Climate (Regiones).xlsx", firstrow clear
(96 vars, 97 obs)

. 
. 
. ************ Estadísticas descriptivas ************
. ssc install asdoc
checking asdoc consistency and verifying not already installed...
all files already exist and are up to date.

. 
. *Estadísticas descriptivas de todas las variables
. 
. asdoc su  ccps Weighted_RT_uptow7  rel_and_science_uptow7 dogood_both_uptow7 Thisworld_b
> oth_uptow7 many_relig_uptow7 log_GDP globaliz coalp_cap dmcry inst cc_percp if _mi_m==0 
> & sam_uptow7==1
(File Myfile.doc already exists, option append was assumed)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ccps |         57    .3523158    .1536715       .081       .824
Weighted_R~7 |         57    .5897605    .2034338   .0771742   .9170642
rel_and_sc~7 |         57      .49756    .2910759   .0151659   .9500595
dogood_bot~7 |         57    .6727692    .1723785   .1587302   .9364665
Thisworld_~7 |         57    .6684984    .1883777   .0836149   .9066667
-------------+---------------------------------------------------------
many_relig~7 |         57    .5208036    .2750347   .0208333   .9387211
     log_GDP |         57    9.488838    .9542647    7.12568   11.73333
    globaliz |         57    67.74929    11.72366   41.82045   89.74843
   coalp_cap |         57     .001131     .002946          0   .0200617
       dmcry |         57    4.224561    6.094619        -10         10
-------------+---------------------------------------------------------
        inst |         57   -.1602926     .934097  -1.818436   1.691806
    cc_percp |         57    .4989474    .1742605        .18         .8
Click to Open File:  Myfile.doc

. 
. 
. ********* Regresiones_no robustas**********
. 
. ** up to w7
. 
. reg ccps Weighted_RT_uptow7 i.WB_EUCA i.WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB
> _EAP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(7, 49)        =      3.71
       Model |  .458088433         7  .065441205   Prob > F        =    0.0027
    Residual |  .864347883        49  .017639753   R-squared       =    0.3464
-------------+----------------------------------   Adj R-squared   =    0.2530
       Total |  1.32243632        56  .023614934   Root MSE        =    .13281

------------------------------------------------------------------------------------
              ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
Weighted_RT_uptow7 |   .4417668   .1337078     3.30   0.002      .173071    .7104626
         1.WB_EUCA |   .0002786   .0999615     0.00   0.998    -.2006016    .2011588
         2.WB_LAAC |   -.076038   .1029788    -0.74   0.464    -.2829816    .1309057
        3.WB_MEANA |  -.0280012   .1194439    -0.23   0.816    -.2680328    .2120304
        5.WB_SAsia |   .1224603   .1377397     0.89   0.378     -.154338    .3992586
     6.WB_SSAfrica |   -.038423   .1172814    -0.33   0.745    -.2741089    .1972628
          7.WB_EAP |   .0187396   .1041135     0.18   0.858    -.1904843    .2279635
             _cons |   .1032728   .1393692     0.74   0.462    -.1768001    .3833456
------------------------------------------------------------------------------------

. 
. reg ccps Weighted_RT_uptow7  log_GDP globaliz coalp_cap dmcry inst cc_percp i.WB_EUCA i.
> WB_LAAC i.WB_MEANA i.WB_SAsia i.WB_SSAfrica i.WB_EAP if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(13, 43)       =      6.71
       Model |  .885619893        13  .068124607   Prob > F        =    0.0000
    Residual |  .436816423        43  .010158521   R-squared       =    0.6697
-------------+----------------------------------   Adj R-squared   =    0.5698
       Total |  1.32243632        56  .023614934   Root MSE        =    .10079

------------------------------------------------------------------------------------
              ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
Weighted_RT_uptow7 |   .3346617   .1099028     3.05   0.004     .1130215    .5563019
           log_GDP |  -.0057968   .0273688    -0.21   0.833    -.0609911    .0493976
          globaliz |    .007006   .0028822     2.43   0.019     .0011935    .0128185
         coalp_cap |   2.036278   5.075391     0.40   0.690    -8.199224    12.27178
             dmcry |   .0074655   .0032922     2.27   0.028     .0008261    .0141048
              inst |  -.0203258   .0285713    -0.71   0.481    -.0779453    .0372937
          cc_percp |   .0841601   .1104644     0.76   0.450    -.1386127    .3069328
         1.WB_EUCA |    .081934   .0804451     1.02   0.314    -.0802989     .244167
         2.WB_LAAC |   .0253612   .0832677     0.30   0.762    -.1425642    .1932866
        3.WB_MEANA |   .1257467   .0960711     1.31   0.198    -.0679991    .3194925
        5.WB_SAsia |   .2517039   .1155346     2.18   0.035     .0187061    .4847017
     6.WB_SSAfrica |    .153845   .1049456     1.47   0.150    -.0577979    .3654879
          7.WB_EAP |   .1059346   .0824104     1.29   0.206    -.0602619     .272131
             _cons |  -.4397898   .2944128    -1.49   0.143     -1.03353    .1539502
------------------------------------------------------------------------------------

. 
. 
. ** por regiones
. 
. **crear variable categórica
. 
. encode Regiones, gen(regiones)

. 
. reg ccps c.Weighted_RT_uptow7##regiones if sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(13, 43)       =      3.83
       Model |  .709691741        13  .054591672   Prob > F        =    0.0004
    Residual |  .612744575        43  .014249874   R-squared       =    0.5367
-------------+----------------------------------   Adj R-squared   =    0.3966
       Total |  1.32243632        56  .023614934   Root MSE        =    .11937

--------------------------------------------------------------------------------------
                ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
  Weighted_RT_uptow7 |   .1930334   .2240797     0.86   0.394    -.2588663    .6449331
                     |
            regiones |
               EUCA  |  -.5938534   .2017704    -2.94   0.005    -1.000762   -.1869446
               LAAC  |   .1362213   .6836563     0.20   0.843    -1.242503    1.514946
              MEANA  |  -.0780103   .2079226    -0.38   0.709    -.4973262    .3413055
           NAmerica  |  -1.190053   2.686252    -0.44   0.660    -6.607395     4.22729
              SAsia  |   .0345386   .1867371     0.18   0.854    -.3420527    .4111299
           SSAfrica  |   .1567515   .2464499     0.64   0.528     -.340262    .6537651
                     |
            regiones#|
c.Weighted_RT_uptow7 |
               EUCA  |   .8693539    .298402     2.91   0.006     .2675689    1.471139
               LAAC  |  -.2849355   .9318888    -0.31   0.761    -2.164268    1.594397
              MEANA  |  -.1304104   .4567207    -0.29   0.777    -1.051475    .7906547
           NAmerica  |   1.559517   3.487949     0.45   0.657    -5.474603    8.593637
              SAsia  |  -.0805621   .3798864    -0.21   0.833     -.846676    .6855518
           SSAfrica  |  -.6128438   .4877186    -1.26   0.216    -1.596422    .3707345
                     |
               _cons |   .2838238   .1505815     1.88   0.066    -.0198528    .5875003
--------------------------------------------------------------------------------------

. 
. reg ccps c.Weighted_RT_uptow7##regiones log_GDP globaliz coalp_cap dmcry inst cc_percp i
> f sam_uptow7==1 & _mi_m==0

      Source |       SS           df       MS      Number of obs   =        57
-------------+----------------------------------   F(19, 37)       =      7.10
       Model |  1.03782009        19   .05462211   Prob > F        =    0.0000
    Residual |  .284616227        37   .00769233   R-squared       =    0.7848
-------------+----------------------------------   Adj R-squared   =    0.6743
       Total |  1.32243632        56  .023614934   Root MSE        =    .08771

--------------------------------------------------------------------------------------
                ccps |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
  Weighted_RT_uptow7 |   .2508085   .1874201     1.34   0.189    -.1289406    .6305577
                     |
            regiones |
               EUCA  |   -.446875   .1636664    -2.73   0.010    -.7784945   -.1152554
               LAAC  |   .2262692   .5249858     0.43   0.669     -.837453    1.289991
              MEANA  |   .1013772   .1705336     0.59   0.556    -.2441567    .4469111
           NAmerica  |  -.9786268   1.989753    -0.49   0.626    -5.010249    3.052995
              SAsia  |   .1519226   .1453323     1.05   0.303    -.1425486    .4463939
           SSAfrica  |   .1844199   .1892958     0.97   0.336    -.1991299    .5679696
                     |
            regiones#|
c.Weighted_RT_uptow7 |
               EUCA  |   .6436296   .2490692     2.58   0.014     .1389676    1.148292
               LAAC  |  -.4404438    .717429    -0.61   0.543    -1.894093    1.013205
              MEANA  |  -.3252117    .381211    -0.85   0.399    -1.097619    .4471952
           NAmerica  |    1.16577   2.584142     0.45   0.655      -4.0702     6.40174
              SAsia  |  -.2729322   .2965377    -0.92   0.363    -.8737747    .3279102
           SSAfrica  |  -.4552862   .3864591    -1.18   0.246    -1.238327    .3277544
                     |
             log_GDP |   -.016279   .0245134    -0.66   0.511    -.0659479    .0333899
            globaliz |   .0045983   .0026286     1.75   0.089    -.0007278    .0099244
           coalp_cap |   2.809427   4.636054     0.61   0.548    -6.584111    12.20296
               dmcry |   .0090044   .0029914     3.01   0.005     .0029432    .0150655
                inst |  -.0171017   .0279064    -0.61   0.544    -.0736454    .0394419
            cc_percp |   .1301404   .1046252     1.24   0.221    -.0818504    .3421311
               _cons |  -.0368494   .2843013    -0.13   0.898    -.6128985    .5391997
--------------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  C:/Users/Portatil/Desktop/Economia_y_Religion/Output/RT_regression/sample_n0_
> weighted_rt.log
  log type:  text
 closed on:   5 Apr 2025, 03:56:57
------------------------------------------------------------------------------------------
